# __Handling Missing Data__

In [2]:
import pandas as pd
import numpy as  np

In [6]:
df=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv')
df

    EmpID    Name       Dept   Age  Salary  Experience
0     101     Ali         IT  22.0   45000         1.0
1     102    Sara         HR  29.0   52000         5.0
2     103   Ahmed         IT  24.0   48000         2.0
3     104    Zara    Finance  31.0   60000         7.0
4     105   Usman         HR  26.0   50000         3.0
5     106    Hina         IT  23.0   47000         1.0
6     107   Bilal         HR  28.0   55000         4.0
7     108    Nida         it  30.0  62,000         6.0
8     109     NaN    Finance   NaN   58000         8.0
9     110    Omer  Marketing  25.0     NaN         2.0
10    101     Ali         IT  22.0   45000         1.0
11    112   Tariq      Sales  45.0   70000        15.0
12    113  Haroon         IT  21.0   55000         NaN
13      0     NaN        NaN   NaN     NaN         NaN
14    114  Shahid         HR  22.0   55000         1.0

## DropNA
    dropna(): Drops Rows that contains NaN Values
    dropna(axis=1) : Drops Columns that contains NaN Values

In [7]:
df.dropna()

    EmpID    Name     Dept   Age  Salary  Experience
0     101     Ali       IT  22.0   45000         1.0
1     102    Sara       HR  29.0   52000         5.0
2     103   Ahmed       IT  24.0   48000         2.0
3     104    Zara  Finance  31.0   60000         7.0
4     105   Usman       HR  26.0   50000         3.0
5     106    Hina       IT  23.0   47000         1.0
6     107   Bilal       HR  28.0   55000         4.0
7     108    Nida       it  30.0  62,000         6.0
10    101     Ali       IT  22.0   45000         1.0
11    112   Tariq    Sales  45.0   70000        15.0
14    114  Shahid       HR  22.0   55000         1.0

In [8]:
df.dropna(axis=1)

    EmpID
0     101
1     102
2     103
3     104
4     105
5     106
6     107
7     108
8     109
9     110
10    101
11    112
12    113
13      0
14    114

##### __how="any" : removes entire row containing NaN__

In [9]:
df.dropna(how="any")

    EmpID    Name     Dept   Age  Salary  Experience
0     101     Ali       IT  22.0   45000         1.0
1     102    Sara       HR  29.0   52000         5.0
2     103   Ahmed       IT  24.0   48000         2.0
3     104    Zara  Finance  31.0   60000         7.0
4     105   Usman       HR  26.0   50000         3.0
5     106    Hina       IT  23.0   47000         1.0
6     107   Bilal       HR  28.0   55000         4.0
7     108    Nida       it  30.0  62,000         6.0
10    101     Ali       IT  22.0   45000         1.0
11    112   Tariq    Sales  45.0   70000        15.0
14    114  Shahid       HR  22.0   55000         1.0